Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_DevelopiOSAppsSwift/DevelopiOSAppsSwift-level2.tmx
Source language: en_us
Languages: ja

source: (Alternatively, choose Editor > Embed In > Stack View.)
ja: （または代わりに、Editor > Embed In > Stack Viewを選んでください。）

source: (Alternatively, choose View > Navigators > Show Project Navigator.)
ja: （または代わりに、View > Navigators > Show Project Navigatorを選んでください。）

source: (Alternatively, choose View > Utilities > Show Object Library.)
ja: （または代わりに、View > Utilities > Show Object Libraryを選びます）

source: (Choose View > Utilities > Show Object Library.)
ja: （View > Utilities > Show Object Libraryを選びます。）

source: (If it doesn’t, choose Automatic > ViewController.swift in the editor selector bar.)
ja: （そうでないならば、Automatic > ViewController.swiftをエディタセレクタバーで選んでください。）

source: (If you try to Control-drag from the image view to your code, you’ll notice that you can’t select Action in the Connection field.)
ja: （あなたがイメージビューからあなたのコードにコントロールドラッグすることを試みるならば、あなたはConnection欄のActionを選択できないことに気づくでしょう。）

source: (Just make sure the names of the images you use match the image names in the code later.)
ja: （ただあなたが使う画像の名前が後のコードの中の画像名と一致するようにしてください。）

source: (Make sure the names of the images you use match the image names in the code later.)
ja: （あなたの使う画像の名前が後のコードでの画像名と一致することを確実にしてください。）

source: (The code to set the label to the text in the text field is a bit more involved, so you’ll write that in the Process User Input section.)
ja: （ラベルをテキスト欄の中のテキストに設定するコードは、もう少し込み入っています、それであなたはユーザ入力処理の節でそれを書くことになります。）

source: (This field is at the bottom of the Size inspector, so you’ll need to scroll down to it.)
ja: （この欄は、Sizeインスペクタの下の方にあります、それであなたはそれまで下にスクロールする必要があるでしょう）

source: (To uncomment the method, remove the /* and */ characters surrounding it.)
ja: （メソッドのコメントを外すには、それを囲んでいる/*と*/文字を削除します。）

source: // #warning Incomplete implementation, return the number of rows
ja: （#警告、実装は不完全です、行の数を返してください）

source: // #warning Incomplete implementation, return the number of sections
ja: （#警告、実装は不完全です、セクションの数を返してください）

source: // Add a new meal.
ja: // （新しい食事を加える。）

source: // Because photo is an optional property of Meal, just use conditional cast.
ja: （写真はMealのオプショナルプロパティなので、条件キャストを使うだけです。

source: // Configure the cell...
ja: （セルを構成する…）

source: // Configure the destination view controller only when the save button is pressed.
ja: （保存ボタンが押される時のみ行先ビューコントローラを構成設定する）

source: // Confirm that the Meal initialier returns nil when passed a negative rating or an empty name.
ja: （負の格付けまたは空の名前を渡された時にMealがnilを返すことを確かめる。）

source: // Create a new instance of the appropriate class, insert it into the array, and add a new row to the table view
ja: // （適切なクラスの新規インスタンスを作成して、それを配列に挿入し、そして新しい行をテーブルビューに加える）

source: // Delete the row from the data source
ja: // （行をデータソースから削除する）

source: // Depending on style of presentation (modal or push presentation), this view controller needs to be dismissed in two different ways.
ja: （表現の流儀（モーダルまたはプッシュ表現）に依存して、このビューコントローラは２つの異なる方法で却下される必要があります。）

source: // Disable the Save button if the text field is empty.
ja: （テキスト欄が空ならばSaveボタンを利用不可能にする。）

source: // Disable the Save button while editing.
ja: （編集の間Saveボタンを利用不可能にする。）

source: // Dismiss the picker if the user canceled.
ja: // （ユーザがキャンセルした場合ピッカーを片付ける。）

source: // Do any additional setup after loading the view, typically from a nib.
ja: （何らかの追加の準備をビューを、大抵はnibからロードした後で行います）

source: // Enable the Save button only if the text field has a valid Meal name.
ja: （Saveボタンをテキスト欄が有効なMeal名を持つ場合にのみ使用可能にする）

source: // Fetches the appropriate meal for the data source layout.
ja: （データソースレイアウトにきちんと合った食事を取ってくる）

source: // Get the new view controller using segue.destinationViewController.
ja: （新規ビューコントローラをsegue.destinationViewControllerを使って得てください。）

source: // Handle the text field’s user input through delegate callbacks.
ja: （テキスト欄のユーザ入力を委任先コールバックを経由して取り扱います。）

source: // If the index of a button is less than the rating, that button should be selected.
ja: （あるボタンのインデックスが格付けより少ないならば、そのボタンは選択されるべき。）

source: // In a storyboard-based application, you will often want to do a little preparation before navigation
ja: （ストーリーボードに基づくアプリケーションにおいて、あなたはしばしばナビゲーションの前に少し準備したいでしょう）

source: // Initialization should fail if there is no name or if the rating is negative.
ja: （初期化は、名前が無いならばまたは格付けが負数ならば、失敗するべきです。）

source: // Initialize stored properties.
ja: （保存プロパティを初期化する）

source: // Load any saved meals, otherwise load sample data.
ja: // （食事があればロードする、そうでなければ見本データをロードする）

source: // Load the sample data.
ja: // （見本データをロードする）

source: // Make sure ViewController is notified when the user picks an image.
ja: （ユーザが画像を選んだときにViewControllerが通知をうけることを確実にします）

source: // Only allow photos to be picked, not taken.
ja: （写真だけが選ばれるようにします、取得はされない）

source: // Override to support conditional editing of the table view.
ja: （テーブルビューの条件付きの編集をサポートするためにオーバーライドする。）

source: // Override to support editing the table view.
ja: （テーブルビューの編集をサポートするためにオーバーライドする。）

source: // Pass the selected object to the new view controller.
ja: （選択されたオブジェクトを新規ビューコントローラに渡してください。）

source: // Put setup code here. This method is called before the invocation of each test method in the class.
ja: // （準備コードをここに置きます。このメソッドはこのクラスの中の各テストメソッドの発動の前に呼ばれます。）

source: // Put teardown code here. This method is called after the invocation of each test method in the class.
ja: // （解体コードをここに置きます。このメソッドはこのクラスの中の各テストメソッドの発動の後に呼ばれます）

source: // Put the code you want to measure the time of here.
ja: （あなたが時間を測定したいコードをここに置きます。）

source: // Rating exceeds maximum
ja: （格付けが最大限度を超える）

source: // Return false if you do not want the specified item to be editable.
ja: （指定した項目が編集されるのをあなたが望まないならばfalseを返してください。）

source: // Save the meals.
ja: // （食事を保存する。）

source: // Set photoImageView to display the selected image.
ja: （photoImageViewを選択された画像を表示するよう設定する。）

source: // Set the meal to be passed to MealTableViewController after the unwind segue.
ja: （mealを巻き戻しセグエの後にMealTableViewControllerに渡されるようにする。）

source: // Set up views if editing an existing Meal.
ja: （既存のMealを編集するならばビューを準備する）

source: // Table view cells are reused and should be dequeued using a cell identifier.
ja: （テーブルビューセルは再利用されます、そしてセル識別子を使ってデキューされるべきです。）

source: // The info dictionary may contain multiple representations of the image. You want to use the original.
ja: （インフォディクショナリは、この画像の複数の表現を格納するかもしれません。オリジナルを使ってはどうでしょう。）

source: // This is an example of a functional test case.
ja: （これは機能テスト項目の例です。）

source: // This is an example of a performance test case.
ja: （これは性能テスト項目の例です。）

source: // This method lets you configure a view controller before it's presented.
ja: （このメソッドは、あなたにビューコントローラをそれが提供される前に構成させます。）

source: // UIImagePickerController is a view controller that lets a user pick media from their photo library.
ja: （UIImagePickerControllerはビューコントローラで、ユーザに彼らの写真ライブラリからメディアを選ばせます。）

source: // Uncomment the following line to display an Edit button in the navigation bar for this view controller.
ja: （以下の行のコメントを外すと、このビューコントローラのナビゲーションバーで「編集」ボタンを表示します）

source: // Uncomment the following line to preserve selection between presentations
ja: （以下の行のコメントを外すと、表示間で選択を保護します）

source: // Update an existing meal.
ja: // （既存の食事を更新する。）

source: // Use the edit button item provided by the table view controller.
ja: // （テーブルビューコントローラによって提供される編集ボタン項目を使う）

source: App Distribution Guide walks you through the process of provisioning devices for testing and submitting apps to the App Store.
ja: 「アプリケーションの配布に関するガイド」は、App Storeに向けてアプリを検査して出荷するためにデバイスをプロビジョニングすることについての過程をあなたに説明します。

source: App Distribution Quick Start walks you through the process of registering as an Apple developer.
ja: App Distribution Quick Startが、あなたにApple開発者として登録する手順を通して案内します。

source: App Programming Guide for iOS explains the essential things you must know and do when developing an iOS app.
ja: 「iOSアプリケーション プログラミングガイド」は、iOSアプリを開発する時あなたが知っていて行わなければならない本質的な事柄を明らかにします。

source: Debugging with Xcode teaches you how to thoroughly debug and test your app in Xcode.
ja: Debugging with Xcodeは、あなたのアプリをXcodeで徹底的にデバッグ及びテストする方法をあなたに教えます。

source: The Swift Programming Language (Swift 3.0.1) describes everything you need to know about Swift.
ja: 「Swiftプログラミング言語（Swift 3.0.1）」は、あなたがSwiftについて知っている必要があるすべてのことを記述します。

source: iOS Human Interface Guidelines teaches you how to make your app consistent with the user interface conventions for iOS.
ja: 「iOS ヒューマンインターフェイス ガイドライン」は、あなたのアプリをiOSのためのユーザインターフェイス取り決めと調和するようにする方法を教えます。

source: iOS Technology Overview describes the frameworks and other technologies that are available to your app in iOS.
ja: 「iOS テクノロジーの概要」は、あなたのアプリがiOSで利用可能なフレームワークと他のテクノロシーを説明します。

source: 2x is the display resolution for iPhone 7 Simulator that you’re using in these lessons, so the image will look best at this resolution.
ja: 2xは、iPhone 7シミュレータ用の画面解像度で、あなたがこのレッスンで使っているものです、それでこの解像度でその画像は最もよく見えるでしょう。

source: 2x is the display resolution for the iPhone 7 Simulator that you’re using in these lessons, so the image will look best at this resolution.
ja: 2xは、iPhone 7シミュレータ用の画面解像度で、あなたがこのレッスンで使っているものです、それでこの解像度でその画像は最もよく見えるでしょう。

source: Array has a property called count that returns the number of items in the array, so the number of rows is meals.count.
ja: Arrayは、countと呼ばれるあるプロパティを持ちます、それは、その配列の中の項目の数を返します、そういうわけで行の数はmeals.countです。

source: ViewController.swift displays in the editor on the right.
ja: ViewController.swiftは、エディタの右に表示されます。

source: viewDidAppear()—Called just after the view controller’s content view has been added to the app’s view hierarchy.
ja: viewDidAppear() — ビューコントローラの持つコンテンツビューがアプリの持つビュー階層へ加えられる直後に呼び出されます。

source: viewDidLoad()—Called when the view controller’s content view (the top of its view hierarchy) is created and loaded from a storyboard.
ja: viewDidLoad()—ビューコントローラのコンテンツビューが作成されてロードされるときにストーリーボードから呼ばれます。

source: viewWillAppear()—Called just before the view controller’s content view is added to the app’s view hierarchy.
ja: viewWillAppear() — ビューコントローラの持つコンテンツビューがアプリの持つビュー階層へ加えられる直前に呼び出されます。

source: NSObject is considered a base class that defines a basic interface to the runtime system.
ja: NSObjectは、基盤クラスとみなされます、それは基本的なインターフェイスを実行時システムに対して定義します。

source: NSCoding is a protocol that enables a lightweight solution for archiving objects and other structures.
ja: NSCodingは、あるプロトコルです、それは、オブジェクトおよび他の構造物のアーカイブ（保存）に対する軽量な解決策となります。

source: XCTAssertNil verifies this by checking that the returned Meal object is nil.
ja: XCTAssertNotNilはこれを検証します、返されるMealオブジェクトがnilであることを調べることによって。

source: XCTAssertNotNil verifies this, by checking that the returned Meal object is not nil.
ja: XCTAssertNotNilはこれを検証します、返されるMealオブジェクトがnilでないことを調べることによって。

source: RatingControl is a custom view subclass of UIView.
ja: RatingControlは、UIViewのカスタムのビュー・サブクラスです。

source: UITableViewController is a subclass of UIViewController, which is designed to handle table view-related logic.
ja: UITableViewControllerは、テーブルビュ関連ロジックを取り扱うために設計されるUIViewControllerのサブクラスです。

source: Checkpoint: Build your app using Command-B.
ja: 確認点：あなたのアプリをコマンド-Bを使ってビルドしてください。

source: Checkpoint: Build your project by choosing Product > Build (or pressing Command-B).
ja: 確認点：あなたのプロパティをProduct > Buildを選ぶこと（またはコマンド-Bを押すこと）によってビルドしてください。

source: Checkpoint: Build your project by choosing Product > Build.
ja: 確認点：あなたのプロジェクトをProduct > Buildを選んでビルドします。

source: Checkpoint: Run your app in iOS Simulator.
ja: 確認点：あなたのアプリをiOSシミュレータで実行してください。

source: Checkpoint: Run your app.
ja: 確認点：あなたのアプリを実行してください。

source: Checkpoint: Test your changes by running the simulator.
ja: 確認点：あなたの変更をシミュレータを実行することでテストしてください。

source: Checkpoint: Build or run your app.
ja: 確認点：あなたのアプリをビルドまたは実行します。

source: Checkpoint: Open Main.storyboard and select the RatingControl object.
ja: 確認点：Main.storyboardを開いて、RatingControlオブジェクトを選択してください。

source: Checkpoint: Run your app again.
ja: 確認点：再びあなたのアプリを実行します。

source: Checkpoint: Run your unit tests by selecting the Product > Test menu item.
ja: 確認点：あなたのユニットテストをProduct > Testメニュー項目を選択することによって実行してください。

source: Checkpoint: Your app runs with the unit test you just wrote.
ja: 確認点：あなたのアプリをあなたが書いたばかりのユニットテストで実行します。

source: Start Developing iOS Apps (Swift) is the perfect starting point for learning to create apps that run on iPhone and iPad.
ja: 「iOSアプリ開発を始めよう（Swift）」は、iPhoneおよびIPadで動作するアプリの作成を学習するための非の打ち所のない出発点です。

source: Auto Layout Guide teaches you how to create adaptive, versatile user interfaces.
ja: 「Cocoa Auto Layout ガイド」は、あなたに適応性のある、融通の利くユーザインターフェイスを作成する方法を教えます。

source: Auto Layout is a powerful layout engine that helps you design adaptive layouts that dynamically respond to any changes to the scene’s size.
ja: 自動レイアウトは強力なレイアウト機構です、それは、画面の大きさに対する何らかの変更に動的に応答する適応性のあるレイアウトをあなたが設計する手助けをします。

source: Gesture recognizers are objects that you attach to a view that allow the view to respond to the user the way a control does.
ja: ジェスチャリコグナイザはオブジェクトです、それはあなたがビューに取り付けて、そのビューがコントロールが行うやり方でユーザに応答できるようにするものです。

source: Outlets provide a way to reference interface objects—the objects you added to your storyboard—from source code files.
ja: アウトレットは、インターフェイスオブジェクト—あなたがストーリーボードに加えたオブジェクト—に、ソースコードファイルから言及する方法を提供します。

source: Unit tests are used for testing small, self-contained pieces of code to make sure they behave correctly.
ja: ユニットテストは、小さな、自己充足のコード断片をテストして、それが正しく振舞うことを確かめるために使われます。

source: Views display content to the user.
ja: おのおののビューは、中身（コンテンツ）を利用者（ユーザ）に表示します。

source: Accessibility hint. A brief, localized phrase that describes the results of an action on an element.
ja: アクセシビリティヒント。 簡潔な、ローカライズされた語句で、ある要素に関するあるアクションの結果を解説します。

source: Accessibility label. A short, localized word or phrase that succinctly describes the control or view, but does not identify the element’s type.
ja: アクセシビリティラベル。 短い、ローカライズされた単語または語句で、簡潔にコントロールやビューを解説します、しかし要素の持つ型を識別しません。

source: Accessibility value. The current value of an element, when the value is not represented by the label.
ja: アクセシビリティ値。 ある要素の現在の値、値がラベルによって表されない時に。

source: Debug and test your app.
ja: あなたのアプリのデバッグとテスト。

source: Learn about the technologies available to you.
ja: あなたに利用可能なテクノロジーについて学ぶ。

source: Learn the Swift programming language.
ja: Swiftプログラミング言語を学ぶ。

source: Learn to design beautiful app interfaces.
ja: 美しいアプリインターフェイスの設計を学ぶ。

source: Learn to develop great apps.
ja: 巨大なアプリの開発について学ぶ。

source: Register as a developer.
ja: 開発者として登録する。

source: Ship your app.
ja: あなたのアプリを出荷する。

source: Fix-its are provided by the compiler as potential solutions to errors in your code.
ja: これらFix-itは、コンパイラによってあなたのコード中のエラーに対する可能性のある解決策として提供されます。

source: View controllers implement your app’s behavior.
ja: ビューコントローラは、あなたのアプリの挙動を実装します。

source: A that’s passed as a parameter to a method that calls the closure when it finishes executing.
ja: パラメータとしてメソッドに渡され、それが実行を完了する時クロージャを呼び出します。

source: A guard statement declares a condition that must be true in order for the code after the guard statement to be executed.
ja: guard文はある条件を宣言します、それはguard文の後のコードが実行されるためにはtrueでなければならないものです。

source: A switch statement considers a value and compares it against several possible matching patterns.
ja: switch文はある値について検討して、それをいくつかの可能なマッチングパターンに対して比較します。

source: A for-in loop iterates over a sequence, such as ranges of numbers, to execute a set of code multiple times.
ja: for-inループは、あるシーケンス（列、一続きのもの）のすべてに渡って繰り返して行きます、例えばある範囲の数などに対して、そうして一組にされたコードを複数回実行します。

source: A Cocoa Touch framework for working with the user interface (UI) layer of an iOS app.
ja: iOSアプリのユーザインターフェイス（UI）階層（レイヤ）を扱うためのあるココアタッチフレームワーク。

source: A class that’s a child of another class (known as its superclass).
ja: あるクラス、それは、別のクラス（スーパークラスとして知られるもの）の子です。

source: A class that’s a parent of another class (known as its subclass).
ja: あるクラス、それは、別のクラス（サブクラスとして知られるもの）の親です。

source: A constant or variable defined only within a particular, limited scope, like a loop, conditional statement, or function.
ja: 定数または変数で、ある特定の、制限されたスコープ（作用範囲）、例えばループ、条件文、または関数などの内部でのみ定義されるもの。

source: A constant, variable, or function defined at the top-level scope of a program.
ja: あるプログラムのトップレベルのスコープで定義される定数、変数、または関数。

source: A delegate is an object that acts on behalf of, or in coordination with, another object.
ja: 委任先は、別のオブジェクトの代わりを務める、またはそれと連携して役割を果たすオブジェクトです。

source: A method that handles the process of preparing an instance of a class, structure, or enumeration for use, which involves setting an initial value for its properties and performing any other required setup.
ja: あるメソッド、それが取り扱うのは、使用するクラス、構造体、または列挙のインスタンスの準備過程です、それはそれのプロパティの初期値の設定となんらかの他の必須の設定の実行を伴います。

source: A navigation controller manages transitions backward and forward through a series of view controllers.
ja: ナビゲーションコントローラは、一続きのビューコントローラの中での前後の場面転換を管理します。

source: A property observer observes and responds to changes in a property’s value.
ja: プロパティオブザーバ（プロパティ監視者）は、監視と応答をあるプロパティの持つ値における変化に対して行います。

source: A segue in which one view controller presents another view controller as its child.
ja: あるセグエ、そこにおいて１つのビューコントローラは別のビューコントローラをそれの子として提示します。

source: A segue that varies the way new content is displayed based on the target view controller.
ja: あるセグエ、それはターゲットビューコントローラに基づいて新しいコンテンツが表示される方法が様々です。

source: A show segue pushes the selected scene onto the top of the navigation stack, and the navigation controller presents that scene.
ja: 表示セグエは、選択されたシーンをナビゲーションスタックの一番上へとプッシュします（積んでいきます）。

source: A storyboard is a visual representation of the app’s user interface, showing screens of content and the transitions between them.
ja: ストーリーボードは、アプリのユーザインターフェイスの視覚による表現です、それはいくつかの画面表示コンテンツとそれらの間の転換を表示します。

source: A storyboard representation of a screen of content in your app.
ja: ストーリーボード表現でのあなたのアプリのある画面内容。

source: A user interface (UI) that automatically adjusts so that it looks good in the context of the available screen space.
ja: あるユーザインターフェイス（UI）、それは、自動的に調節することで利用可能な画面空間の状況にふさわしく見えるようになります。

source: A view object that’s located at the top of a view hierarchy, serving as a container for the subviews in its hierarchy.
ja: あるビューオブジェクト、それは、ビュー階層の最上部に位置して、その階層の中のサブビューの容れ物としての役割を果たします。

source: A view that encloses another view (known as its subview).
ja: あるビュー、それは、別のビュー（サブビューとして知られるもの）を納めているものです。

source: A view that is enclosed by another view (known as its superview).
ja: あるビュー、それは、別のビュー（スーパービューとして知られるもの）に納められます。

source: A Universal app is one that runs on both iPhone and iPad.
ja: Universalアプリは、iPhoneとiPadの両方で動作するものです。

source: A bar that contains information related to a scene in a storyboard.
ja: xストーリーボードの中のあるシーンに関連した情報を含むバー。

source: A blueprint of methods, properties, and other requirements that suit a particular task or piece of functionality.
ja: メソッド、プロパティ、そして他の要件の設計図、それは、ある特定の作業または一片の機能性を満足させるものです。

source: A button called Item appears where you dragged the bar button item.
ja: Itemという名のボタンが、あなたがバーボタン項目（Bar Button Item）をドラッグしたところに現れます。

source: A button can be in more than one state at the same time, such as when a button is both disabled and highlighted.
ja: ボタンは、同時にひとつ以上の状態になることができます、例えばあるボタンが使用不能と強調の両方であるなど。

source: A button is highlighted whenever the user touches it.
ja: ボタンは、ユーザがそれをタッチするときはいつでも強調されます。

source: A button is interactive, so users can tap it to trigger an action that you define.
ja: ボタンはインタラクティブ（ユーザと相互作用するもの）です、なのでユーザはそれをタップしてある動作を引き起こすことができます、その動作はあなたが定義します。

source: A capability to add functionality to an existing type.
ja: 機能性を既存の型に追加する能力。

source: A category of programming in which the flow of the app is determined by events: system events and user actions.
ja: プログラミングの１分類、そこにおいてアプリの動作の流れを決定するのは、イベント：システムイベントおよびユーザアクションです。

source: A class that’s at the root of its class hierarchy, meaning that it has no superclass.
ja: それのクラス階層のルートであるクラス、それがスーパークラスを持たないことを意味します。

source: A comment that begins with the characters //MARK: is a special type of comment that’s used to organize your code and to help you (and anybody else who reads your code) navigate through it.
ja: 文字//MARK:で始まるコメントは、コメントの特別な種類で、それが使われるのはあなたのコードを系統立てるためやあなたが（そしてあなたのコードを読む他の誰でも）それを見ていく助けとするためです。

source: A complementary set of teardown methods exists, as shown in the state transition diagram above.
ja: 補完的なひと揃いの解体メソッドが、上の状態推移図で見せたように存在します。

source: A control (UIControl) is a subclass of UIView.
ja: コントロール（UIControl）は、UIViewのサブクラスです。

source: A control flow statement that checks whether a condition is true before executing a piece of code.
ja: ある制御流れ文、それは、ある条件が真かどうか、一片のコードを実行する前に調べます。

source: A control flow statement that executes the same piece of code multiple times.
ja: ある制御流れ文、それは同じコード断片を複数回実行します。

source: A cursor appears in a text field, letting you enter text.
ja: カーソルがテキスト欄に現れて、あなたにテキストを入力させます。

source: A cursor appears, letting you enter text.
ja: カーソルが現れて、あなたにテキストを入力させます。

source: A data model represents the structure of the information stored in an app.
ja: あるデータモデルは、あるアプリの中に格納される情報の構造を表現します。

source: A data type that defines a group of related values and enables you to work with those values in a type-safe way within your code.
ja: あるデータ型、それは、関連した値からなるあるグループを定義して、あなたにそれらの値をあなたのコード内で型安全な方法で扱うことを可能にします。

source: A data type that stores multiple values of the same type in an ordered list.
ja: あるデータ型、それは、同じ型の複数の値をある順番付けられたリストにおいて保管します。

source: A data type that’s similar to a class, but doesn’t support inheritance and is passed by value instead of by reference.
ja: あるデータ型、それは、クラスに似ています、しかし継承をサポートしません、そして参照ではなく値として渡されます。

source: A design pattern in which one object sends a message to another object when a specific event occurs.
ja: ひとつのデザインパターン、そこにおいてオブジェクトは、特定のイベントが起こるときメッセージを別のオブジェクトに送ります。

source: A feature of Xcode that infers what you’re trying to type from context and provides suggestions that you can select.
ja: あるXcodeの機能、それは、あなたがタイプしようとしているのは何か文脈から推測して、あなたが選ぶことができる提案を提供します。

source: A file that contains a visual representation of the app’s UI (user interface), showing screens of content and the transitions between them, that you work on in Interface Builder.
ja: あるファイル、それは、アプリのもつ視覚表現でのUI（ユーザインターフェイス）を含んでいて、画面内容やそれらの移り変わり（トランジション）を見せるものです、それについてはあなたがインターフェイスビルダーで作業します。

source: A functioning table view requires three table view data source methods.
ja: 機能するテーブルビューは、３つのテーブルビューデータソースメソッドを必要とします。

source: A grouping of values.
ja: いくつかの値をグループにしたもの。

source: A hierarchical representation of views relative to other views.
ja: ビューと他のビューとの関係の階層的表現。

source: A hierarchical representation of a class’s relationships to its superclass and subclasses.
ja: あるクラスのもつそれのスーパークラスとサブクラスに対する間柄の階層的表現。

source: A key is simply a string value.
ja: キーは、単なる文字列値です。

source: A label isn’t interactive; it just displays static text in the user interface.
ja: ラベルは相互作用するもの（インタラクティブ）ではありません；それはただ静的なテキストをユーザインターフェイスにおいて表示するだけです。

source: A layout engine that helps lay out your user interface (UI) based on the constraints you specify.
ja: あるレイアウト機構、それは、あなたのユーザインターフェイス（UI）のレイアウト（配置）をあなたが指定する制約に基づいて手伝います。

source: A list appears showing each object’s name, description, and visual representation.
ja: 各オブジェクトの名前、説明、そして視覚的表現を示しているリストが現れます。

source: A menu appears in the location where the drag ended.
ja: メニューが、ドラッグが終わったところに現れます。

source: A modal view controller doesn’t get added to the navigation stack, so it doesn’t get a navigation bar in Interface Builder.
ja: モーダルビューコントローラは、ナビゲーションスタックに加えられていません、それでそれはInterface Builderにおいてナビゲーションバーを取得していません。

source: A pane in a storyboard that lets you see a hierarchical representation of the objects in your storyboard.
ja: ストーリーボード内の枠（ペーン）の一つ、それはあなたのストーリーボード内のオブジェクトの階層的な表現をあなたに見させます。

source: A pattern of app design in which view controllers serve as the communication pipeline between views and the data model.
ja: アプリ設計のパターンの１つ、そこにおいてビューコントローラはビューとデータモデルの間の通信パイプランとしての用をなします。

source: A piece of code that describes the behavior and properties common to any particular type of object, essentially providing a blueprint for the object.
ja: あるまとまったコード片、それは、なんらかの特定の種類（型）のオブジェクトに共通の挙動やプロパティ（特性）を記述して、そのオブジェクトの設計図を基本的に提供します。

source: A piece of code that’s called every time the value of a property is set.
ja: 一片のコード、それは、あるプロパティの値が設定されるたびごとに呼ばれます。
